Revit 2027 API
DirectShapeReferenceOptions.IsValidReferenceName Method
 Validates that the input name can be assigned to a direct shape reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidReferenceName(
	string name
)
Public Shared Function IsValidReferenceName (
	name As String
) As Boolean
public:
static bool IsValidReferenceName(
	String^ name
)
static member IsValidReferenceName :
        name : string -> bool
Parameters
name String
 The name to assign to the reference.
Return Value
Boolean
 True if the input name is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace